# Ultralytics YOLO 🚀, Custom Model for Pothole Segmentation
# YOLOv11s-seg tabanlı, DSConv + SimAM + GELU entegreli model
#
# Bu model çukur tespiti için optimize edilmiştir:
# - DSConv: Kıvrımlı/düzensiz kenarlı çukurları daha iyi yakalar
# - SimAM: Çukur vs yama/gölge ayrımını iyileştirir  
# - GELU: Daha stabil öğrenme sağlar

# Model parametreleri
nc: 1  # Sınıf sayısı (pothole - çukur)
scales:
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]  # small versiyon

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0 - P1/2 - Giriş downsampling
  - [-1, 1, Conv, [128, 3, 2]]                   # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 2
  - [-1, 1, Conv, [256, 3, 2]]                   # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 4
  - [-1, 1, Conv, [512, 3, 2]]                   # 5 - P4/16
  - [-1, 2, C3k2, [512, True]]                   # 6
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7 - P5/32
  - [-1, 2, C3k2, [1024, True]]                  # 8
  - [-1, 1, SPPF, [1024, 5]]                     # 9
  - [-1, 2, C2PSA, [1024]]                       # 10

# Head (Segmentation için FPN + PAN)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12 - cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15 - cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 16 - P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18 - cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 19 - P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21 - cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 22 - P5/32-large

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]    # 23 - Segment head (P3, P4, P5)

